<a href="https://colab.research.google.com/github/maithstartup/Notebooks-Practical-ML-Beginners/blob/master/pandas/pandas_merge__join.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## <font color='blue'>Basic Merge Using a Dataframe Column</font>

In [ ]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [ ]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [ ]:
df3 = pd.merge(df1, df2, on="city" )
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## <font color='blue'>Type Of DataBase Joins</font>

<img src="db_joins.jpg" height="800", width="800">

In [ ]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [ ]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [ ]:
df3=pd.merge(df1,df2,on="city",how="inner")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [ ]:
df3=pd.merge(df1,df2,on="city",how="outer")
df3

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

In [ ]:
df3=pd.merge(df1,df2,on="city",how="left")
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [ ]:
df3=pd.merge(df2,df1,on="city",how="right")
df3

        city  humidity  temperature
0    chicago      65.0           14
1   new york      68.0           21
2    orlando       NaN           35
3  baltimore       NaN           38

In [ ]:
df3=pd.merge(df1,df2,on="city",how="right")
df3

        city  temperature  humidity
0   new york         21.0        68
1    chicago         14.0        65
2  san diego          NaN        71

## <font color='blue'>indicator flag</font>

In [ ]:
df3=pd.merge(df1,df2,on="city",how="outer",indicator=True)
df3

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  baltimore         38.0       NaN   left_only
4  san diego          NaN      71.0  right_only

## <font color='blue'>suffixes</font>

In [ ]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [ ]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [ ]:
df3= pd.merge(df1,df2,on="city",how="outer", suffixes=('_first','_second'))
df3

        city  temperature_first  ...  temperature_second  humidity_second
0   new york               21.0  ...                14.0             68.0
1    chicago               14.0  ...                21.0             65.0
2    orlando               35.0  ...                 NaN              NaN
3  baltimore               38.0  ...                 NaN              NaN
4  san diego                NaN  ...                35.0             71.0

[5 rows x 5 columns]

## <font color='blue'>join</font>

In [ ]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city',inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [ ]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "temperature": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          temperature
city
chicago            65
new york           68
orlando            75

In [ ]:
df3 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df3.set_index('city',inplace=True)
df3

          humidity
city
chicago         65
new york        68
orlando         75

In [ ]:

df1.join(df3,lsuffix='_l', rsuffix='_r'  )

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75

In [ ]:

df1.join(df2,lsuffix='_l', rsuffix='_r'  )

          temperature_l  temperature_r
city
new york             21             68
chicago              14             65
orlando              35             75